app/views/home/index.html.erb

SELECT "guidelines".* FROM "guidelines" ORDER BY name
---
    <%= label_tag 'Select a state' %>
    <%= select_tag("state", options_for_select(Guidelines.all.collect {|s| [ s.name, s.state ] })) %>