app/controllers/guidelines_controller.rb

  def index
    @states = Guidelines.select("name, state")
---
SELECT name, state FROM "guidelines" ORDER BY name