app/controllers/register_controller.rb

SELECT name, state FROM "guidelines" ORDER BY name
---
  def index
    @states = Guidelines.select("name, state")

SELECT "guidelines".* FROM "guidelines" WHERE "guidelines"."state" = 'CA' ORDER BY name LIMIT 1
SELECT "instructions".* FROM "instructions" WHERE "instructions"."state" = 'CA'
---
  def new

    session[:register] = nil
    @guidelines = Guidelines.find_by_state(params[:state])
    @state = params[:state]


    if @guidelines.nil?
      redirect_to register_index_path, :alert => "Invalid State"
    else
      @instructions = Instructions.where(:state => @state)

SELECT "guidelines".* FROM "guidelines" WHERE "guidelines"."state" = 'CA' ORDER BY name LIMIT 1
---
  def complete

    if session[:register].blank?
      redirect_to root_path
    else
      @register = session[:register]
      @state_info = Guidelines.find_by_state(@register.home_state)