app/views/register/_form.html.erb

    <legend>Additional Information</legend>
    <%= f.input :political_party, :collection => PoliticalParty.pluck(:name), :hint => help_text(@instructions,"political_party")  %>
    <%= f.input :ethnicity, :collection => Ethnicity.pluck(:name), :hint => help_text(@instructions, "ethnicity") %>
---
SELECT name FROM "political_parties" ORDER BY name
SELECT name FROM "ethnicities"